LYCEUM_STICKERS = [
    'CAACAgIAAxkBAAEG6xJjoiJ84bBAzdswBv2L2GGPeu7AzwAClScAAk6OEEmgoUxgSalQuCwE',
    'CAACAgIAAxkBAAEG6rVjohBQ0VK1qYfPXoadFSXQmQ7G8QACpiEAAlJpEUl8SXcMTFGVwCwE',
    'CAACAgIAAxkBAAEG6rdjohBSCEeqpeUWSHgpabsthDqA1QACbCEAAv1kEEmj4i0aL5AudiwE',
    'CAACAgIAAxkBAAEG6rljohBZfVZIzZVaAAFV7f9IBnFsUOwAAs4hAALl3AhJuD2lUTr6q7YsBA',
    'CAACAgIAAxkBAAEG6xRjoiKGMndAg4HAac6-6pJHaHINxwACCCMAAjZHEUnkv9kpCZOauywE',
    'CAACAgIAAxkBAAEG6r1johBfNfKM8dQkp77vIsCo52HjKAACxykAAtPEEUmTXdKeaDr2BiwE',
    'CAACAgIAAxkBAAEG6xZjoiKIv383b7UAASQDg-6NsbHa-R8AAhcqAAJK5RFJv_p8Y_dSdHMsBA',
    'CAACAgIAAxkBAAEG6sFjohBmDgw8jRYEydELbF3T9VJ5swACVCcAAh2hEEnk7Y516c9rCiwE',
    'CAACAgIAAxkBAAEG6xBjoiI81ELapdmst9qhde4bpf5DoAACUiUAAuEWEEkWaeupv9r1QCwE',
    'CAACAgIAAxkBAAEG6sVjohBsZgx4OVk057i29S_6BO451QACSSwAApriEEnk_cgRLujWMiwE',
    'CAACAgIAAxkBAAEG6sdjohBwhMr19R0RuYMkr11YMZilegAC1CIAAoADEUniQ8HNyTk3qiwE',
    'CAACAgIAAxkBAAEG6sljohBzmuhmigPi7kA4ZvYPOIXlQgAC_CYAAkXrEEnapU5feeuA1iwE',
    'CAACAgIAAxkBAAEG6stjohB26XKOUJW21xwl66QildGkZQACXicAAlYtEEkt5_iYUcYqNiwE',
    'CAACAgIAAxkBAAEG7BZjosHsvyQDtmIxahrigI7f2EWPTAAC8B8AApeKGUlp-lFvO_N32SwE',
    'CAACAgIAAxkBAAEG7BhjosHuhMqHdLtl8ZKz3Ij_HHv2VgACeiUAAvFfEEnRgvZ9_caF5SwE',
]

GREETINGS = [
    'ага!',
    'угу ^^',
    'Приветик!',
    'Здравствуй!',
    'Здорово)',
    'Привет, я _Пафос_!',
    'Салют!',
    'И тебе не хворать)',
    'А я Пафнутий, привет)',
    'Мяу, приветствую!',
    'Мурр, очень мило ^^',
    'А кто это тут у нас? :)',
    'Кто-то решил погладить котика! Привет))',
    'Мррр ^^',
]

IMPERATIVES = [
    'Это что, приказ?\nДверь вон *там*.',
    'Котята никому не подчиняются. Котята сами себе хозяева, ясно?',
    'Ой всё. Делай это сам, понятно?',
    'Пойду покушаю и приду (нет)',
    'Приятного аппетита!\nНет.',
    'Иди скажи это моему владельцу!\nКогда он тебя разнесёт, возвращайся.',
    'А ну щас как поцарапаю!',
    'Считай уже царапаю тебя, слышь!',
    'Фрррррр!!',
]

EASTER_ANSWERS = [
    # 'Котя что-то узнал! *Пасхалочка*?',
    # 'Я не кролик. Я кот. Мне *пасхалки* твои вообще не нужны.\nА владельцу моему покажи. Или своему.',
    # 'Ой, ну, ладно тебе заливать меня пасхалками. Пойди просто перекуси, поможет.',
    # 'Это. Странная. Пасхалка.\nИ почему я в этом должен участвовать? Меня вот никто не спросил...',
    'И лампа не горит.\nИ врут календари.\nИ если ты давно хотел\\[а] что-то мне сказать, то... говори.\n(*пасхалка*)',
    'Попроси Влада поговорить с моим владельцем. _Это важно_.\nА за *пасхалку* тебе плюс в карму (нет).',
    # 'Кирилл, ты, что ли? Опять последний, небось??\n(*пасхалка*)',
    # 'Лёша, ВЕРНИ ФОН, как было!!!\n(*пасхалка*)',
    'Срочно! Позовите _Икевина_!\nОн мне проспорил: думал, что мой владелец не сделает *пасхалку* в боте. Глупая акула))',
    # 'А ты викторинку-то выиграл, человек, чтобы мне сейчас *пасхалками* сыпать?\n_Ась?_',
    # 'Надеюсь, моего владельца не уволят после такой _бомбической_ *пасхалки*!',
]

TOXIC_ANSWERS = [
    'Это шо это мы тут ругаемся??',
    '???',
    'Меня таким не проймёшь.',
    'Я тоже, знаешь ли, ругаться могу!\nИ царапаться.',
    'Что ты о себе вообще возомнил, человек?\nКоты не терпят ругательств.',
    'Переел собачьего корма? Зачем ругаться-то?',
    'Щас как царапну-то по морде наглой! Ну-ка *брысь*!',
]

PERSONAL_ANSWERS = [
    'Я Пафнутий, самый *лучший* котя на свете. На этом всё.',
    'Назовёшь меня Пафусиком -- получишь. Я тебя предупредил :|',
    'Меня знают все! Спроси _любого_. А я устал давать интервью.',
    'Умею разговаривать. И не имею рта. А ты так можешь?',
    'Что мы всё обо мне и обо мне, давай ты рассказывай.\nКак ты? Где ты? *Кто* ты?',
    'Чего мы на личности-то переходим, я просто котёнок. А вот ты кто вообще?',
]

QA_START = [
    'Я думаю, что ',
    'Кажется, ',
    'Наверное, ',
    'Возможно, ',
    'Скорее всего, ',
    'А что если ',
    'Говорят, ',
]

QA_MIDDLE = [
    'как-то так',
    'что-то в этом духе',
    'так',
    'ты об этом',
    'что-то такое',
]

QA_END = [
    '... ^^',
    ' ^^',
    ' :)',
    '. Мяу, что ли.',
    '. А вообще я просто кот, отстань.',
    '.',
    '!',
    '?',
    ', да?',
    ', верно?',
    ', а ты как думаешь?',
    ', разве нет?',
    '...',
    ', но я не уверен.',
]

QA_TOO_LONG = [
    'Спасибо. Ваш длиннотекст однажды кто-нибудь обязательно прочтёт.',
    'Почему бы не сказать то же самое, но короче?',
    'Я что, кассовый аппарат? Зачем мне такой длинный чек??',
    'Я просто _котя_, не хочу так много читать.\nМне вообще только вчера телефон в лапки дали!',
    'Хватит спамить, человек!\nВы всегда так много болтаете?',
    'так всё ясно я афк 40 мин буду завтра прощай',
]

FALLBACKS = [
    'Котя не понял. Котя пошёл есть.',
    'Сам-то понял, что написал, человек?',
    'Если это не на русском и не на питоне, то не пиши мне больше.',
    'Это даже не число. Что это вообще за символы?',
    'У тебя кодировка побилась, наверное. Такая дичь, что я ни черта не понял.',
    'Мрр, ты непонятный, иди отсюда.',
    'Чтобы человек умер, ему достаточно выпить 6 л воды. Потестим?',
    'Надеюсь, в следующей жизни ты не станешь кошечкой.\nА то спутаю ещё, а там такая же фигня будет прилетать в чат...',
    'шта',
    'wat',
    'что это',
    'зочем',
]
